{
    "history": {
        "mgdb": {
            "name": "Mission Guatemala Database",
            "type": "BW Capstone Project",
            "work_start": "Spring 2024",
            "work_end": "Present",
            "skills": ["C#", ".NET", "WinForms", "Scrum"],
            "tidbits": ["Help create app to help clinic move from paper-based operations to digital operations", "As scrum master, ensure everyone remains on task by keeping track of \"daily standup\" posts and by creating mid-term and end-of-term reports of completed work."],
            "description": "The Mission Guatemala Database project (commonly called \"MGDB\" or simply \"Mission Guatemala\") is an application that helps a clinic in Guatemala handle record-keeping, including keeping track of patients who have visited the clinic, patient health information, patient payments, and much more.",
            "my_work": ["Speed up patient list retrieval (consisting of over 10,000 patients!)", "Implement fuzzy search to find patients easier", "Help implement \"front desk\" feature to keep track of patient payments"],
            "images": ["https://media.licdn.com/dms/image/v2/D5622AQFTOnuNyGChgQ/feedshare-shrink_2048_1536/feedshare-shrink_2048_1536/0/1733586117643?e=1737590400&v=beta&t=dhLNXqJPmqh1IlxKLsBJFPgQJhfZFxSJD0ZH_RlM71c", "https://media.licdn.com/dms/image/v2/D5622AQHIUHy-epT0VA/feedshare-shrink_1280/feedshare-shrink_1280/0/1733586117011?e=1737590400&v=beta&t=HZYL--AZ_b-hOEnLHsUtn9crk_bXPy9Ip9y5vAvMK1Y", "https://media.licdn.com/dms/image/v2/D5622AQEg2QXhFkwE2A/feedshare-shrink_2048_1536/feedshare-shrink_2048_1536/0/1733586117795?e=1737590400&v=beta&t=dtOkLaM5XxjK5QcrzPCAqGb5bWyA5_Jrh8K2ixdL5G4"]
        },
        "website": {
            "name": "pjoschmann.com",
            "type": "Personal Project",
            "skills": ["Vue.js", "HTML", "CSS", "JavaScript", "Javascript Frameworks", "Web Development"],
            "tidbits": ["Create an online digital portfolio to introduce myself, share my professional experience, and showcase school & personal projects", "Sharpen web development skills"],
            "description": "Creating this portfolio gave me a chance to refresh myself on HTML, CSS, and JavaScript. Since web development isn't baked in to my school's software engineering curriculum, I took this opportunity to learn Vue.js, a widely-used JavaScript framework."
        },
        "shortcut_maker": {
            "name": "Shortcut Maker",
            "type": "Personal Project",
            "skills": ["GTK","Python"],
            "tidbits": ["Create application to easily create desktop entries on the GNOME desktop", "Follow GNOME Human Interface Guidelines to create an intuitive, accessible design"],
            "description": "Shortcut Maker is an application that helps users easily create desktop entries on the GNOME desktop, a common Linux desktop environment.\n\nUsually, Linux software is distributed by some sort of repository, and installed using a package manager. As such, the concept of creating a \"desktop shortcut\" for software is uncommon; software is rarely downloaded from the internet.\n\nHowever, in some cases, like when compiling software from source, a package manager may not be used to install the application. This often means the application will make no attempt to integrate with the system's application launcher.\n\nIn these cases, Shortcut Maker makes it easy to integrate those apps. Rather than being forced to create a so-called \"desktop entry\" by hand, a user can use Shortcut Maker to configure how the application should appear in the system app launcher."
        }
    }
}